In [17]:
import pandas as pd
import numpy as np

data = {
    "name": ["Alice", "Bob", "Charlie", "David", "Eve", "Frank", "Alice"],
    "age": [25, 30, np.nan, 40, np.nan, 50, 25],
    "city": ["Houston", "Chicago", "Chicago", "Houston", "Miami", "Miami", "Houston"],
    "salary": [50000, 60000, np.nan, 80000, 90000, 100000, 50000]
}

df = pd.DataFrame(data)
df

      name   age     city    salary
0    Alice  25.0  Houston   50000.0
1      Bob  30.0  Chicago   60000.0
2  Charlie   NaN  Chicago       NaN
3    David  40.0  Houston   80000.0
4      Eve   NaN    Miami   90000.0
5    Frank  50.0    Miami  100000.0
6    Alice  25.0  Houston   50000.0

In [3]:
df.isnull().sum()

name      0
age       2
city      0
salary    1
dtype: int64

In [5]:
df.notnull().sum()

name      6
age       4
city      6
salary    5
dtype: int64

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     4 non-null      float64
 2   city    6 non-null      object
 3   salary  5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 320.0+ bytes

In [9]:
df

      name   age     city    salary
0    Alice  25.0  Houston   50000.0
1      Bob  30.0  Chicago   60000.0
2  Charlie   NaN  Chicago       NaN
3    David  40.0  Houston   80000.0
4      Eve   NaN    Miami   90000.0
5    Frank  50.0    Miami  100000.0

In [11]:
df.dropna(inplace=True)

In [12]:
df

    name   age     city    salary
0  Alice  25.0  Houston   50000.0
1    Bob  30.0  Chicago   60000.0
3  David  40.0  Houston   80000.0
5  Frank  50.0    Miami  100000.0

In [14]:
df.drop_duplicates(inplace=True)

In [16]:
df.dropna(subset=['salary'])

    name   age     city    salary
0  Alice  25.0  Houston   50000.0
1    Bob  30.0  Chicago   60000.0
3  David  40.0  Houston   80000.0
4    Eve   NaN    Miami   90000.0
5  Frank  50.0    Miami  100000.0

In [25]:
# Box Plot
data = {
    'student': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Alice'],
    'marks': [85, 90, 78, 400, 88, 76, 900]
}

df = pd.DataFrame(data)
df

   student  marks
0    Alice     85
1      Bob     90
2  Charlie     78
3    David    400
4      Eve     88
5    Frank     76
6    Alice    900

In [26]:
Q1 = df['marks'].quantile(0.25)
Q3 = df['marks'].quantile(0.75)
IQR = Q3 - Q1

print(f'The Q1 is {Q1}, the Q3 is {Q3}, the IQR is {IQR}')

lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR
print(lower_bound, upper_bound)

outlier = df[(df['marks'] < lower_bound) | (df['marks'] > upper_bound)]

The Q1 is 81.5, the Q3 is 245.0, the IQR is 163.5
-163.75 490.25

In [27]:
outlier

  student  marks
6   Alice    900

In [28]:
#Imputing values
import pandas as pd
import numpy as np

data = {
    'student': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Alice'],
    'marks': [85, 90, np.nan, np.nan, np.nan, 76, np.nan]
}

df = pd.DataFrame(data)
df

   student  marks
0    Alice   85.0
1      Bob   90.0
2  Charlie    NaN
3    David    NaN
4      Eve    NaN
5    Frank   76.0
6    Alice    NaN

In [29]:
df.fillna(df['marks'].mean())

   student      marks
0    Alice  85.000000
1      Bob  90.000000
2  Charlie  83.666667
3    David  83.666667
4      Eve  83.666667
5    Frank  76.000000
6    Alice  83.666667